# Create Database and Tables Using Terminal
The dataset and questions used in this sheet are from Databases and SQL for Data Science, a course is part of Coursera's IBM Data Science Professional Certificate Specialization

### Create Database
sqlite> .open hr.db

### Create Tables
##### Table 'employee'
sqlite> CREATE TABLE employees(<br />
   ...> emp_id VARCHAR PRIMARY KEY NOT NULL,<br />
   ...> f_name VARCHAR NOT NULL,<br />
   ...> l_name VARCHAR NOT NULL,<br />
   ...> ssn VARCHAR,<br />
   ...> b_date BLOB,<br />
   ...> address VARCHAR,<br />
   ...> job_id VARCHAR,<br />
   ...> salary REAL,<br />
   ...> manager_id VARCHAR,<br />
   ...> dep_id VARCHAR NOT NULL);<br />

##### Table 'departments'
sqlite> CREATE TABLE departments(<br />
   ...> dept_id_dep VARCHAR NOT NULL,<br />
   ...> dep_name TEXT,<br />
   ...> manager_id VARCHAR,<br />
   ...> loc_id VARCHAR);<br />
   
##### Table 'job_history'
sqlite> CREATE TABLE job_history(<br />
   ...> empl_id VARCHAR NOT NULL,<br />
   ...> start_date BLOB,<br />
   ...> jobs_id VARCHAR NOT NULL,<br />
   ...> PRIMARY KEY(empl_id, jobs_id));<br />

##### Table 'jobs'
sqlite> CREATE TABLE job(<br />
   ...> job_ident VARCHAR NOT NULL,<br />
   ...> job_title VARCHAR,<br />
   ...> min_salary REAL,<br />
   ...> max_salary REAL,<br />
   ...> PRIMARY KEY(job_ident));<br />
   
##### Table 'location'
sqlite> CREATE TABLE location(<br />
   ...> loct_id VARCHAR NOT NULL,<br />
   ...> dep_id_loc VARCHAR,<br />
   ...> PRIMARY KEY(loct_id, dep_id_loc));<br />

# Practice Queries Using HR Database

In [9]:
import pandas as pd
import sqlite3 as lite

In [10]:
db = lite.connect('./hr.db')

## Question 1
Retrieve all employees whose address is in Elgin,IL

In [12]:
query1 = '''
SELECT f_name, l_name
FROM employees
WHERE address like '%Elgin,IL'
'''
pd.read_sql(query1, db)

  f_name l_name
0  Alice  James
1  Nancy  Allen
2    Ann  Jacob

## Question 2
Retrieve all employees who were born during the 1970's.

In [17]:
query2 = '''
SELECT f_name, l_name, b_date
FROM employees
WHERE b_date like '%197%'
'''
pd.read_sql(query2, db)

  f_name  l_name      b_date
0   John  Thomas  01/09/1976
1  Alice   James  07/31/1972
2  Nancy   Allen  02/06/1978
3   Mary  Thomas  05/05/1975

## Question 3
Retrieve all employees in department 5 whose salary is between
60000 and 70000 .

In [18]:
query3 = '''
SELECT f_name, l_name, salary, dep_id
FROM employees
WHERE dep_id=5
AND salary BETWEEN 60000 AND 70000;
'''
pd.read_sql(query3, db)

    f_name l_name   salary dep_id
0  Santosh  Kumar  60000.0      5
1      Ann  Jacob  70000.0      5

## Question 4A
Retrieve a list of employees ordered by department ID

In [21]:
query4a = '''
SELECT f_name, l_name, dep_id
FROM employees
ORDER BY dep_id;
'''
pd.read_sql(query4a, db)

    f_name   l_name dep_id
0     John   Thomas      2
1    Ahmed  Hussain      2
2    Nancy    Allen      2
3    Alice    James      5
4    Steve    Wells      5
5  Santosh    Kumar      5
6      Ann    Jacob      5
7     Mary   Thomas      7
8  Bharath    Gupta      7
9   Andrea    Jones      7

## Question 4B
 Retrieve a list of employees ordered in descending order by
department ID and within each department ordered alphabetically in
descending order by last name

In [23]:
query4b = '''
SELECT f_name, l_name, dep_id
FROM employees
ORDER BY dep_id DESC, l_name;
'''
pd.read_sql(query4b, db)

    f_name   l_name dep_id
0  Bharath    Gupta      7
1   Andrea    Jones      7
2     Mary   Thomas      7
3      Ann    Jacob      5
4    Alice    James      5
5  Santosh    Kumar      5
6    Steve    Wells      5
7    Nancy    Allen      2
8    Ahmed  Hussain      2
9     John   Thomas      2

## Question 5A
For each department ID retrieve the number of employees in the
department

In [26]:
query5a = '''
SELECT dep_id AS dept, count(*) AS num_empl
FROM employees
GROUP BY dep_id;
'''
pd.read_sql(query5a, db)

  dept  num_empl
0    2         3
1    5         4
2    7         3

## Question 5B
For each department retrieve the number of employees in the department, and the average employees salary in the department

In [28]:
query5b = '''
SELECT dep_id AS dept, count(*) AS num_empl, AVG(salary) AS avg_salary
FROM employees
GROUP BY dep_id;
'''
pd.read_sql(query5b, db)

  dept  num_empl    avg_salary
0    2         3  86666.666667
1    5         4  65000.000000
2    7         3  66666.666667

## Question 5C
In Query 5B limit the result to departments with fewer than 4 employees

In [30]:
query5c = '''
SELECT dep_id AS dept, count(*) AS num_empl, AVG(salary) AS avg_salary
FROM employees
GROUP BY dep_id HAVING num_empl < 4;
'''
pd.read_sql(query5c, db)

  dept  num_empl    avg_salary
0    2         3  86666.666667
1    7         3  66666.666667